---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCData.AsString
source: html/bee331de-a48d-c155-337e-d58a5f9e9afb.htm
---
# Autodesk.Revit.DB.IFC.IFCData.AsString Method

Gets storage value as string when its PrimitiveType is string, binary or enumeration.

## Syntax (C#)
```csharp
public string AsString()
```

## Returns
The string value.

## Exceptions
- **Autodesk.Revit.Exceptions.InapplicableDataException** - The primitive type is not string, binary or enumeration.